---
kind: other
id: Methods.T:Autodesk.Revit.DB.RevitLinkType
source: html/ec58f667-bfbf-b48c-323e-4b6138824a42.htm
---
# RevitLinkType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.